SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( GW60xxDC
 comment( King Class 6029 King George VI )
 Type ( Engine )
 WagonShape ( GW60xxDC.s )
 Size ( 2.74015m 4.097531m 13.48493m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( 0.00966656m 2.07816m -0.353967m )
 Mass ( 90t )
 InertiaTensor ( Box (2.74015m 4.097531m 13.48493m) )
 Coupling (
  Type ( Bar )
  Spring (  comment ( AndiWide19 ) 
   Stiffness ( 0N/m 2e6N/m )
   Damping ( 1e3N/m/s 2.5e6N/m/s )
   Break ( 1.0e9N 1.0e9N )
   r0 ( 0m 0.08m )
  )
  CouplingUniqueType ( RH4000BRL )
  CouplingHasRigidConnection ( 1 )
  Velocity ( 0.1m/s )
 )
 Coupling (
  Type ( Chain )
  Spring (  comment ( AndiWide19 ) 
   Stiffness ( 0N/m 2e6N/m )
   Damping ( 1e3N/m/s 2.5e6N/m/s )
   Break ( 1.0e9N 1.0e9N )
   r0 ( 0m 0.08m )
  )
  Velocity ( -0.1m/s )
 )
 Buffers (
  Spring (  comment ( stiff2 ) 
   Stiffness ( 1e6N/m 1e7N/m )
   Damping ( 0N/m/s 0N/m/s )
   Break ( 500kN 500kN )
   r0 ( 0m 0.05m )
  )
  Centre ( 0.5 )
  Radius ( 1 )
  Angle ( 1deg )
 ) 
  
 FreightAnim ( "..\\common.crew\\BA_1\\Standard_4T.s" 0 3.0 0.0 )
 Adheasion ( 0.070 0.140 2.0 0 )
 DerailRailHeight ( 4cm )
 DerailRailForce ( 360kN )
 DerailBufferForce ( 500kN )
 WheelRadius ( 0.4572m )
 NumWheels ( 5 )
 Friction (
  1092N/m/s 0 0.001m/s 7.72N/m/s 1.98
  0N/rad/s 0 0.001rad/s 34433N/rad/s 0.88
 )

 BrakeEquipmentType ( "Vacuum_brake, Triple_valve" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce ( 90kN )

 MaxHandbrakeForce ( 135kN )

 NumberOfHandbrakeLeverSteps ( 100 )
 
 MaxReleaseRate ( 1 )
 MaxApplicationRate ( 1 )
 MaxAuxilaryChargingRate( 10 )
 BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 )        

    Sound ( "..\\..\\hw_Common.sound\\2Cyl_generic\\HWH-2c-100a-eng01.sms" )

 Lights ( 19
  



Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
    Headlight ( 0 )
    Unit ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 80ff7200 )
     Position ( 0 2.1 -5.7 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 80ffe610 )
     Position ( 0 2.1 -5.7 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 1.4 )
     )
    )
   )


Light (
   comment( Sphere of light )
    Type  ( 1 )
    Conditions (
    Headlight ( 3 )
    Unit ( 2 )
   )
    Cycle  ( 0 )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    States ( 1
            State (
      Duration ( 0.0 )
      LightColour ( 80ff7200 )
      Position ( 0 0.0 -10 )
      Transition ( 0 )
      Radius ( 8.0 )
      Angle ( 100.0 )
                                                )
                                 )
         )

 

Light (
   comment( Flickering front oil lamp top chim1 )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 4.10 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 4.10 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )



Light (
   comment( Flickering front oil lamp top chim2 )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 4.10 )
     Azimuth ( 0 90 90 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 4.10 )
     Azimuth ( 90.0 90.0 90.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )



Light (
   comment( Flickering front oil lamp top chim3 )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 4.10 )
     Azimuth ( -90 -90 -90 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 4.10 )
     Azimuth ( -90.0 -90.0 -90.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )

Light (
   comment( Flickering front oil lamp top chim4 )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 4.10 )
     Azimuth ( 180 180 180 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 4.10 )
     Azimuth ( 180.0 180.0 180.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )



Light (
   comment( Flickering front oil lamp top chim1b )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 3.57 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 3.57 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )



Light (
   comment( Flickering front oil lamp top chim2b )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 3.57 )
     Azimuth ( 0 90 90 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 3.57 )
     Azimuth ( 90.0 90.0 90.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )



Light (
   comment( Flickering front oil lamp top chim3b )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 3.57 )
     Azimuth ( -90 -90 -90 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 3.57 )
     Azimuth ( -90.0 -90.0 -90.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )

Light (
   comment( Flickering front oil lamp top chim4b )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 3.57 )
     Azimuth ( 180 180 180 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 80ff7200 )
     Position ( 0 4.05 3.57 )
     Azimuth ( 180.0 180.0 180.0 )
     Transition ( 0 )
     Radius ( 0.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )

Light (
   comment( Flickering front oil lamp front )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 40ff0000 )
     Position ( 0 0.50 -3.40 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 2.3 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 40ff4000 )
     Position ( 0 0.50 -3.40 )
     Azimuth ( 0.0 -5.0 5.0 )
     Transition ( 0 )
     Radius ( 2.3 )
     Elevation ( -10 -10 -10 )
     )
    )
   )

Light (
   comment( Flickering front oil lamp left )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 40ff4000 )
     Position ( 0 0.50 -3.70 )
     Azimuth ( -90.0 -90.0 -90.0 )
     Transition ( 0 )
     Radius ( 2.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 40ff0000 )
     Position ( 0 0.50 -3.70 )
     Azimuth ( -90.0 -90.0 -90 )
     Transition ( 0 )
     Radius ( 2.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )

Light (
   comment( Flickering front oil lamp right )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.09 )
     LightColour ( 40ff0000 )
     Position ( 0 0.50 -3.80 )
     Azimuth ( 90.0 90.0 90.0 )
     Transition ( 0 )
     Radius ( 2.7 )
     Elevation ( -10 -10 -10 )
     )
    State (
     Duration ( 0.05 )
     LightColour ( 40ff4000 )
     Position ( 0 0.50 -3.80 )
     Azimuth ( 90.0 90.0 90.0 )
     Transition ( 0 )
     Radius ( 2.7 )
     Elevation ( -10 -10 -10 )
     )
    )
   )

Light (
   comment( Flickering rear oil lamp rear )
   Type  ( 0 )
   Conditions (
    Headlight ( 3 )
    Unit ( 2 )
    Coupling ( 0 )
    )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
    State (
     Duration ( 0.05 )
     LightColour ( 40ff4000 )
     Position ( 0 0.50 -3.90 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 2.0 )
     )
    State (
     Duration ( 0.09 )
     LightColour ( 40ff0000 )
     Position ( 0 0.50 -3.90 )
     Azimuth ( -180 -180 -180 )
     Transition ( 0 )
     Radius ( 2.0 )
     )
    )
   )
Light (
   comment( Head light right dim )
    Type  ( 0 )
    Conditions (
       Headlight ( 3 )
       Unit ( 2 )
      )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 1
       State (
         Duration ( 0.0 )
         LightColour ( 99ffffff )
         Position ( -0.84 1.35 5.85 )
         Azimuth ( 0.0 -5.0 5.0 )
         Transition ( 0 )
         Radius ( 0.4 )
         Elevation ( -10 -10 -10 )
        )
      )
   )
Light (
   comment( Head light left dim )
    Type  ( 0 )
    Conditions (
       Headlight ( 3 )
       Unit ( 2 )
      )
    FadeIn ( 0.5 )
    FadeOut ( 0.5 )
    Cycle  ( 0 )
    States ( 1
       State (
         Duration ( 0.0 )
         LightColour ( 99ffffff )
         Position ( 0.86 1.35 5.85 )
         Azimuth ( 0.0 -5.0 5.0 )
         Transition ( 0 )
         Radius ( 0.4 )
         Elevation ( -10 -10 -10 )
        )
      )
   )
  )
 )




Engine ( GW60xxDC 

 Effects
 (
  SteamSpecialEffects
  (
   comment
   (
    the format of these little blocks is as follow:

    offset.x offset.y offset.z
    normal.x normal.y normal.z
    width in metres

    defining the offset from the shape pivot point
    where steam / smoke should appear, the direction
    it should go and the width of the nozzle
   )

   WhistleFX
   (
    0 4.2 -4.55
    0 1 0
    0.09
   )

   SafetyValvesFX
   (
    0 4.1 -0.60
    0 0.7 0
    0.2
   )

   StackFX
   (
    0 4.2 3.8
    0 1.5 0
    0.25
   )

   DrainpipeFX
   (
    -1.5 1.258 -3.886
    -0.4 -1 -0.2
    0.05
   )

   CylindersFX
   (
    -0.8 0.5 3.9
    0 -0.3 1.75
    0.1
   )

   CylindersFX
   (
    0.8 0.5 3.9
    0 -0.3 1.75
    0.1
   )
  )
 )

 Wagon ( GW60xxDC )
 IsTenderRequired( 1 ) 
 Type ( Steam )
 EngineBrakesControllerMinSystemPressure ( 0 )
 EngineBrakesControllerMaxSystemPressure ( 21 )
 EngineBrakesControllerDirectControlExponent ( 1.5 )
 TrainBrakesControllerMaxApplicationRate ( 1 )
 TrainBrakesControllerEmergencyApplicationRate ( 1 )
 TrainBrakeControllerMinContinuousService ( 0 )
 Injector1WaterValveVarience ( 0.1 )
 Injector2WaterValveVarience ( 0.1 )
 CutoffMaxReverse ( -0.75 )
 CutoffMaxForward ( 0.75 )
 CutoffSmallestSetting ( 10 )
 MaxPower ( 1517.25kW )
 MaxForce ( 40286lbf )
 MaxVelocity ( 95mph )
 WheelRadius ( 0.991m )
 Sanding ( 1e9mph )
 NumWheels ( 2 )
 BoilerLength ( 8.11m )
 BoilerVolume ( "473.86*(ft^3)" )
 BoilerEffectivity ( 1 )
 DraftingEffect ( 0.95 )
 BoilerResponsiveness ( 1.05 )
 CoalBurnage ( 2.5 )
 MaxBoilerOutput ( 34835lb/h )
 NumCylinders ( 4 )
 CylinderStroke ( 28in )
 CylinderDiameter ( 16.25in )
 CylinderVolume ( "26.9*(ft^3)" )
 CylinderEffectivity ( 1 )
 InjectorSizes ( 29mm 29mm )
 ExhaustLimit ( 38318lb/h )
 PrimingFactor ( .95 )
 SteamMinPrimingLevel ( 1.1 )
 BlastExponent ( 0.6 )
 MaxBoilerPressure ( 250psi )
 MaxFireMass ( 2444lb )
 IdealFireMass ( 1784lb )
 MaxWaterMass ( 4912lb )  
 SafetyValvesSteamUsage ( 30000 )
 ShovelCoalMass ( 10lb )
 SmokeCombustion ( 1 )
 MaxTenderCoalMass ( 13440lb )
 MaxTenderWaterMass ( 40000lb )

 comment(0 for live steam, 1 for exhaust steam)
 InjectorTypes ( 0 1 ) 
 Injector1FeedrateMultiplierExhaust ( 1 )
      Injector1FeedrateMultiplierLive ( 1 )
      Injector2FeedrateMultiplierExhaust ( 1 )
      Injector2FeedrateMultiplierLive ( 1 )
      Injector1WaterValveVariance ( 0.75 )
      Injector2WaterValveVariance ( 0.75 )
 SuperHeater ( 1.22 )
 SteamSmokeUnitsPerPoundOfFuel( 1 )
 SteamMaxSmokeUnitsReleaseRate( 10 )
 MaxSteamHeatingPressure( 20 )
 SafetyValvePressureDifference ( 25 )
 SteamGaugeGlassHeight( 10 )
 SteamFiremanMaxPossibleFiringRate( 37500 )

 BasicSteamUsage ( 1741lb/h )
 BasicCoalUsage ( 248lb/h )

 comment( min steam pressure, min water proportion, max water proportion  )
 InjectorLimits1 ( 50psi 0 1 )
 InjectorLimits2 ( 60psi 0 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

      VacuumBrakesSmallEjectorPowerRating ( 7 )
 VacuumBrakesMinBoilerPressureMaxVacuum ( 125 )
 VacuumBrakesSmallEjectorUsageRate ( 696 )
 VacuumBrakesLargeEjectorUsageRate ( 2090 )
 VacuumBrakesHasVacuumPump ( 0 )

 TrainBrakesControllerMaxReleaseRate ( 1 )
 TrainBrakesControllerMinSystemPressure ( 0 )
 TrainBrakesControllerMaxSystemPressure ( 21 )

 EngineBrakesControllerHasProportionalBrake( 1 )
      EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType ( "Vacuum_single_pipe" )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
      BrakesEngineControllers ( "Independent,Train" )

 SteamSmallestCutoff( 8 )
 NumberOfDamperSteps( 4 )

 RegulatorValveType ( Single_port )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorPilotValveExponent ( 1 )
 RegulatorSecondValveExponent( 1.7 )
 RegulatorPilotValveFullOpenning ( 1 )
 RegulatorMainValveInitialOpenning( 0.4 )

 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )

 SteamWaterScoopMinPickupSpeed( 25 ) comment( mph )
 SteamWaterScoopMaxPickupSpeed( 60 ) comment( mph )
 SteamWaterScoopResistance( 8500N )
 comment( pounds per second. 6000gallons per minute max. )
 SteamWaterScoopMaxPickupRate( 1000 )


 CabView ( "GW60xxDC.cvf" )

 HeadOut (  -1.2 3.35 -5.0 )
        EngineControllers (
            comment( standardised engine controls )
        
            Regulator ( 0 1 0.02 0 
                NumNotches( 0 )
            )
            Cutoff    ( -0.75 0.75 0.05 0 
                NumNotches( 0 )
            )
            Brake_Train ( 0 1 0.1 0.65 
                NumNotches( 4
                    Notch ( 0     1 TrainBrakesControllerReleaseStart )
                    Notch ( 0.4   0 TrainBrakesControllerHoldStart )
                    Notch ( 0.42  1 TrainBrakesControllerApplyStart )
                    Notch ( 1     1 TrainBrakesControllerEmergencyStart ) 
                )
            )
            Brake_Engine ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Brake_Hand ( 0 1 0.0125 0 
                NumNotches( 0 )
            )
            FireDoor ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0 
                NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.025 0 
                NumNotches( 0 )
            )
            Shovel ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            DampersFront ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            DampersBack ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            Injector2Water ( 0 1 0.1 0 
                NumNotches( 0 )
            )
            CylinderCocks ( 0 1 0 )
            Whistle ( 0 1 0 )
            BellToggle ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 0 )
            Headlights( 0 1 0 )
        )


 comment(fire temp, fire mass, water mass, boiler pressure,
  water level, tender_water_mass, tender_coal_mass,
  smoke_quantity, fire_condition, coal quality )
  
 EngineVariables ( 800 1427 3778 238 1.0 40000 1.0 0.8 1 1)
 comment(fire temp:       min. 300, max. 1000
         fire mass:       ideal 1784, max. 2444
         water mass:      max. 4912
         boiler pressure: max. 250 )

     Sound ( "..\\..\\hw_Common.sound\\2Cyl_generic\\HWH-2c-100a-cab01.sms" )
     Name ( "BR HW - WR King Class 6029" ) 
  Description (
  " "
 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+  
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)